tap "hashicorp/tap"
tap "lihaoyun6/tap"
tap "theboredteam/boring-notch"
tap "thusvill/livewallpaper"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Command-line tool to export and inspect local iMessage database
brew "imessage-exporter"
# Find what models run on your hardware
brew "llmfit"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql-client"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Image processing library
brew "vips"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Network security monitor
brew "zeek"
# Terraform
brew "hashicorp/tap/terraform"
# Open source colour effects manager for Razer devices
cask "1kc-razer"
# Get the battery level of all your devices on your Mac.
cask "lihaoyun6/tap/airbattery"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch"
# Client for the Box cloud storage service
cask "box-drive"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Web security testing toolkit
cask "burp-suite"
# Chat client for https://twitch.tv
cask "chatterino"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Screen mirroring and digital signage
cask "ditto"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-fira-code"
cask "font-jetbrains-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# Chromium-based web browser
cask "helium-browser"
# Utility to hide menu bar items
cask "hiddenbar"
# HTTP(S) debugging proxy, analyzer, and client
cask "http-toolkit"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Customise mouse behavior
cask "linearmouse"
# Open-source live wallpaper application
cask "thusvill/livewallpaper/livewallpaper"
# Software for Logitech devices
cask "logi-options+"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source software for live streaming and screen recording
cask "obs"
# Get up and running with large language models locally
cask "ollama-app"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Sideload iOS apps and games
cask "playcover-community"
# Collaboration platform for API development
cask "postman"
# Minecraft launcher
cask "prismlauncher"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# File sharing network
cask "soulseek"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Batch rename utility
cask "transnomino"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "Ghost Buster Pro", id: 1607749385
mas "iMovie", id: 408981434
mas "PairVPN", id: 1347012179
mas "Post-it®", id: 1475777828
mas "Raycast Companion", id: 6738274497
mas "uBlock Origin Lite", id: 6745342698
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alfredbirk.tailwind-documentation"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "emilijanmb.sublime-text-4-theme"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "gerane.theme-salmononice"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "mightbesimon.emoji-icons"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "msjsdiag.vscode-react-native"
vscode "nickdemayo.vscode-json-editor"
vscode "stivo.tailwind-fold"
